{
    "<s>": 0,
    "<pad>": 1,
    "</s>": 2,
    "<unk>": 3,
    "<mask>": 4,
    "0": 5,
    "0.1": 6,
    "0.2": 7,
    "0.3": 8,
    "0.4": 9,
    "0.5": 10,
    "0.6": 11,
    "0.7": 12,
    "0.8": 13,
    "0.9": 14,
    "1": 15,
    "1.1": 16,
    "1.2": 17,
    "1.3": 18,
    "1.4": 19,
    "1.5": 20,
    "1.6": 21,
    "1.7": 22,
    "1.8": 23,
    "1.9": 24,
    "2": 25,
    "2.1": 26,
    "2.2": 27,
    "2.3": 28,
    "2.4": 29,
    "2.5": 30,
    "2.6": 31,
    "2.7": 32,
    "2.8": 33,
    "2.9": 34,
    "3": 35,
    "3.1": 36,
    "3.2": 37,
    "3.3": 38,
    "3.4": 39,
    "3.5": 40,
    "3.6": 41,
    "3.7": 42,
    "3.8": 43,
    "3.9": 44,
    "4": 45,
    "4.1": 46,
    "4.2": 47,
    "4.3": 48,
    "4.4": 49,
    "4.5": 50,
    "4.6": 51,
    "4.7": 52,
    "4.8": 53,
    "4.9": 54,
    "5": 55,
    "5.1": 56,
    "5.2": 57,
    "5.3": 58,
    "5.4": 59,
    "5.5": 60,
    "5.6": 61,
    "5.7": 62,
    "5.8": 63,
    "5.9": 64,
    "6": 65,
    "6.1": 66,
    "6.2": 67,
    "6.3": 68,
    "6.4": 69,
    "6.5": 70,
    "6.6": 71,
    "6.7": 72,
    "6.8": 73,
    "6.9": 74,
    "7": 75,
    "7.1": 76,
    "7.2": 77,
    "7.3": 78,
    "7.4": 79,
    "7.5": 80,
    "7.6": 81,
    "7.7": 82,
    "7.8": 83,
    "7.9": 84,
    "8": 85,
    "8.1": 86,
    "8.2": 87,
    "8.3": 88,
    "8.4": 89,
    "8.5": 90,
    "8.6": 91,
    "8.7": 92,
    "8.8": 93,
    "8.9": 94,
    "9": 95,
    "9.1": 96,
    "9.2": 97,
    "9.3": 98,
    "9.4": 99,
    "9.5": 100,
    "9.6": 101,
    "9.7": 102,
    "9.8": 103,
    "9.9": 104,
    "10": 105,
    "10.1": 106,
    "10.2": 107,
    "10.3": 108,
    "10.4": 109,
    "10.5": 110,
    "10.6": 111,
    "10.7": 112,
    "10.8": 113,
    "10.9": 114,
    "11": 115,
    "11.1": 116,
    "11.2": 117,
    "11.3": 118,
    "11.4": 119,
    "11.5": 120,
    "11.6": 121,
    "11.7": 122,
    "11.8": 123,
    "11.9": 124,
    "12": 125,
    "12.1": 126,
    "12.2": 127,
    "12.3": 128,
    "12.4": 129,
    "12.5": 130,
    "12.6": 131,
    "12.7": 132,
    "12.8": 133,
    "12.9": 134,
    "13": 135,
    "13.1": 136,
    "13.2": 137,
    "13.3": 138,
    "13.4": 139,
    "13.5": 140,
    "13.6": 141,
    "13.7": 142,
    "13.8": 143,
    "13.9": 144,
    "14": 145,
    "14.1": 146,
    "14.2": 147,
    "14.3": 148,
    "14.4": 149,
    "14.5": 150,
    "14.6": 151,
    "14.7": 152,
    "14.8": 153,
    "14.9": 154,
    "15": 155,
    "15.1": 156,
    "15.2": 157,
    "15.3": 158,
    "15.4": 159,
    "15.5": 160,
    "15.6": 161,
    "15.7": 162,
    "15.8": 163,
    "15.9": 164,
    "16": 165,
    "16.1": 166,
    "16.2": 167,
    "16.3": 168,
    "16.4": 169,
    "16.5": 170,
    "16.6": 171,
    "16.7": 172,
    "16.8": 173,
    "16.9": 174,
    "17": 175,
    "17.1": 176,
    "17.2": 177,
    "17.3": 178,
    "17.4": 179,
    "17.5": 180,
    "17.6": 181,
    "17.7": 182,
    "17.8": 183,
    "17.9": 184,
    "18": 185,
    "18.1": 186,
    "18.2": 187,
    "18.3": 188,
    "18.4": 189,
    "18.5": 190,
    "18.6": 191,
    "18.7": 192,
    "18.8": 193,
    "18.9": 194,
    "19": 195,
    "19.1": 196,
    "19.2": 197,
    "19.3": 198,
    "19.4": 199,
    "19.5": 200,
    "19.6": 201,
    "19.7": 202,
    "19.8": 203,
    "19.9": 204,
    "20": 205,
    "20.1": 206,
    "20.2": 207,
    "20.3": 208,
    "20.4": 209,
    "20.5": 210,
    "20.6": 211,
    "20.7": 212,
    "20.8": 213,
    "20.9": 214,
    "21": 215,
    "21.1": 216,
    "21.2": 217,
    "21.3": 218,
    "21.4": 219,
    "21.5": 220,
    "21.6": 221,
    "21.7": 222,
    "21.8": 223,
    "21.9": 224,
    "22": 225,
    "22.1": 226,
    "22.2": 227,
    "22.3": 228,
    "22.4": 229,
    "22.5": 230,
    "22.6": 231,
    "22.7": 232,
    "22.8": 233,
    "22.9": 234,
    "23": 235,
    "23.1": 236,
    "23.2": 237,
    "23.3": 238,
    "23.4": 239,
    "23.5": 240,
    "23.6": 241,
    "23.7": 242,
    "23.8": 243,
    "23.9": 244,
    "24": 245,
    "24.1": 246,
    "24.2": 247,
    "24.3": 248,
    "24.4": 249,
    "24.5": 250,
    "24.6": 251,
    "24.7": 252,
    "24.8": 253,
    "24.9": 254,
    "25": 255,
    "25.1": 256,
    "25.2": 257,
    "25.3": 258,
    "25.4": 259,
    "25.5": 260,
    "25.6": 261,
    "25.7": 262,
    "25.8": 263,
    "25.9": 264,
    "26": 265,
    "26.1": 266,
    "26.2": 267,
    "26.3": 268,
    "26.4": 269,
    "26.5": 270,
    "26.6": 271,
    "26.7": 272,
    "26.8": 273,
    "26.9": 274,
    "27": 275,
    "27.1": 276,
    "27.2": 277,
    "27.3": 278,
    "27.4": 279,
    "27.5": 280,
    "27.6": 281,
    "27.7": 282,
    "27.8": 283,
    "27.9": 284,
    "28": 285,
    "28.1": 286,
    "28.2": 287,
    "28.3": 288,
    "28.4": 289,
    "28.5": 290,
    "28.6": 291,
    "28.7": 292,
    "28.8": 293,
    "28.9": 294,
    "29": 295,
    "29.1": 296,
    "29.2": 297,
    "29.3": 298,
    "29.4": 299,
    "29.5": 300,
    "29.6": 301,
    "29.7": 302,
    "29.8": 303,
    "29.9": 304,
    "30": 305,
    "30.1": 306,
    "30.2": 307,
    "30.3": 308,
    "30.4": 309,
    "30.5": 310,
    "30.6": 311,
    "30.7": 312,
    "30.8": 313,
    "30.9": 314,
    "31": 315,
    "31.1": 316,
    "31.2": 317,
    "31.3": 318,
    "31.4": 319,
    "31.5": 320,
    "31.6": 321,
    "31.7": 322,
    "31.8": 323,
    "31.9": 324,
    "32": 325,
    "32.1": 326,
    "32.2": 327,
    "32.3": 328,
    "32.4": 329,
    "32.5": 330,
    "32.6": 331,
    "32.7": 332,
    "32.8": 333,
    "32.9": 334,
    "33": 335,
    "33.1": 336,
    "33.2": 337,
    "33.3": 338,
    "33.4": 339,
    "33.5": 340,
    "33.6": 341,
    "33.7": 342,
    "33.8": 343,
    "33.9": 344,
    "34": 345,
    "34.1": 346,
    "34.2": 347,
    "34.3": 348,
    "34.4": 349,
    "34.5": 350,
    "34.6": 351,
    "34.7": 352,
    "34.8": 353,
    "34.9": 354,
    "35": 355,
    "35.1": 356,
    "35.2": 357,
    "35.3": 358,
    "35.4": 359,
    "35.5": 360,
    "35.6": 361,
    "35.7": 362,
    "35.8": 363,
    "35.9": 364,
    "36": 365,
    "36.1": 366,
    "36.2": 367,
    "36.3": 368,
    "36.4": 369,
    "36.5": 370,
    "36.6": 371,
    "36.7": 372,
    "36.8": 373,
    "36.9": 374,
    "37": 375,
    "37.1": 376,
    "37.2": 377,
    "37.3": 378,
    "37.4": 379,
    "37.5": 380,
    "37.6": 381,
    "37.7": 382,
    "37.8": 383,
    "37.9": 384,
    "38": 385,
    "38.1": 386,
    "38.2": 387,
    "38.3": 388,
    "38.4": 389,
    "38.5": 390,
    "38.6": 391,
    "38.7": 392,
    "38.8": 393,
    "38.9": 394,
    "39": 395,
    "39.1": 396,
    "39.2": 397,
    "39.3": 398,
    "39.4": 399,
    "39.5": 400,
    "39.6": 401,
    "39.7": 402,
    "39.8": 403,
    "39.9": 404,
    "40": 405,
    "40.1": 406,
    "40.2": 407,
    "40.3": 408,
    "40.4": 409,
    "40.5": 410,
    "40.6": 411,
    "40.7": 412,
    "40.8": 413,
    "40.9": 414,
    "41": 415,
    "41.1": 416,
    "41.2": 417,
    "41.3": 418,
    "41.4": 419,
    "41.5": 420,
    "41.6": 421,
    "41.7": 422,
    "41.8": 423,
    "41.9": 424,
    "42": 425,
    "42.1": 426,
    "42.2": 427,
    "42.3": 428,
    "42.4": 429,
    "42.5": 430,
    "42.6": 431,
    "42.7": 432,
    "42.8": 433,
    "42.9": 434,
    "43": 435,
    "43.1": 436,
    "43.2": 437,
    "43.3": 438,
    "43.4": 439,
    "43.5": 440,
    "43.6": 441,
    "43.7": 442,
    "43.8": 443,
    "43.9": 444,
    "44": 445,
    "44.1": 446,
    "44.2": 447,
    "44.3": 448,
    "44.4": 449,
    "44.5": 450,
    "44.6": 451,
    "44.7": 452,
    "44.8": 453,
    "44.9": 454,
    "45": 455,
    "45.1": 456,
    "45.2": 457,
    "45.3": 458,
    "45.4": 459,
    "45.5": 460,
    "45.6": 461,
    "45.7": 462,
    "45.8": 463,
    "45.9": 464,
    "46": 465,
    "46.1": 466,
    "46.2": 467,
    "46.3": 468,
    "46.4": 469,
    "46.5": 470,
    "46.6": 471,
    "46.7": 472,
    "46.8": 473,
    "46.9": 474,
    "47": 475,
    "47.1": 476,
    "47.2": 477,
    "47.3": 478,
    "47.4": 479,
    "47.5": 480,
    "47.6": 481,
    "47.7": 482,
    "47.8": 483,
    "47.9": 484,
    "48": 485,
    "48.1": 486,
    "48.2": 487,
    "48.3": 488,
    "48.4": 489,
    "48.5": 490,
    "48.6": 491,
    "48.7": 492,
    "48.8": 493,
    "48.9": 494,
    "49": 495,
    "49.1": 496,
    "49.2": 497,
    "49.3": 498,
    "49.4": 499,
    "49.5": 500,
    "49.6": 501,
    "49.7": 502,
    "49.8": 503,
    "49.9": 504,
    "50": 505,
    "50.1": 506,
    "50.2": 507,
    "50.3": 508,
    "50.4": 509,
    "50.5": 510,
    "50.6": 511,
    "50.7": 512,
    "50.8": 513,
    "50.9": 514,
    "51": 515,
    "51.1": 516,
    "51.2": 517,
    "51.3": 518,
    "51.4": 519,
    "51.5": 520,
    "51.6": 521,
    "51.7": 522,
    "51.8": 523,
    "51.9": 524,
    "52": 525,
    "52.1": 526,
    "52.2": 527,
    "52.3": 528,
    "52.4": 529,
    "52.5": 530,
    "52.6": 531,
    "52.7": 532,
    "52.8": 533,
    "52.9": 534,
    "53": 535,
    "53.1": 536,
    "53.2": 537,
    "53.3": 538,
    "53.4": 539,
    "53.5": 540,
    "53.6": 541,
    "53.7": 542,
    "53.8": 543,
    "53.9": 544,
    "54": 545,
    "54.1": 546,
    "54.2": 547,
    "54.3": 548,
    "54.4": 549,
    "54.5": 550,
    "54.6": 551,
    "54.7": 552,
    "54.8": 553,
    "54.9": 554,
    "55": 555,
    "55.1": 556,
    "55.2": 557,
    "55.3": 558,
    "55.4": 559,
    "55.5": 560,
    "55.6": 561,
    "55.7": 562,
    "55.8": 563,
    "55.9": 564,
    "56": 565,
    "56.1": 566,
    "56.2": 567,
    "56.3": 568,
    "56.4": 569,
    "56.5": 570,
    "56.6": 571,
    "56.7": 572,
    "56.8": 573,
    "56.9": 574,
    "57": 575,
    "57.1": 576,
    "57.2": 577,
    "57.3": 578,
    "57.4": 579,
    "57.5": 580,
    "57.6": 581,
    "57.7": 582,
    "57.8": 583,
    "57.9": 584,
    "58": 585,
    "58.1": 586,
    "58.2": 587,
    "58.3": 588,
    "58.4": 589,
    "58.5": 590,
    "58.6": 591,
    "58.7": 592,
    "58.8": 593,
    "58.9": 594,
    "59": 595,
    "59.1": 596,
    "59.2": 597,
    "59.3": 598,
    "59.4": 599,
    "59.5": 600,
    "59.6": 601,
    "59.7": 602,
    "59.8": 603,
    "59.9": 604,
    "60": 605,
    "60.1": 606,
    "60.2": 607,
    "60.3": 608,
    "60.4": 609,
    "60.5": 610,
    "60.6": 611,
    "60.7": 612,
    "60.8": 613,
    "60.9": 614,
    "61": 615,
    "61.1": 616,
    "61.2": 617,
    "61.3": 618,
    "61.4": 619,
    "61.5": 620,
    "61.6": 621,
    "61.7": 622,
    "61.8": 623,
    "61.9": 624,
    "62": 625,
    "62.1": 626,
    "62.2": 627,
    "62.3": 628,
    "62.4": 629,
    "62.5": 630,
    "62.6": 631,
    "62.7": 632,
    "62.8": 633,
    "62.9": 634,
    "63": 635,
    "63.1": 636,
    "63.2": 637,
    "63.3": 638,
    "63.4": 639,
    "63.5": 640,
    "63.6": 641,
    "63.7": 642,
    "63.8": 643,
    "63.9": 644,
    "64": 645,
    "64.1": 646,
    "64.2": 647,
    "64.3": 648,
    "64.4": 649,
    "64.5": 650,
    "64.6": 651,
    "64.7": 652,
    "64.8": 653,
    "64.9": 654,
    "65": 655,
    "65.1": 656,
    "65.2": 657,
    "65.3": 658,
    "65.4": 659,
    "65.5": 660,
    "65.6": 661,
    "65.7": 662,
    "65.8": 663,
    "65.9": 664,
    "66": 665,
    "66.1": 666,
    "66.2": 667,
    "66.3": 668,
    "66.4": 669,
    "66.5": 670,
    "66.6": 671,
    "66.7": 672,
    "66.8": 673,
    "66.9": 674,
    "67": 675,
    "67.1": 676,
    "67.2": 677,
    "67.3": 678,
    "67.4": 679,
    "67.5": 680,
    "67.6": 681,
    "67.7": 682,
    "67.8": 683,
    "67.9": 684,
    "68": 685,
    "68.1": 686,
    "68.2": 687,
    "68.3": 688,
    "68.4": 689,
    "68.5": 690,
    "68.6": 691,
    "68.7": 692,
    "68.8": 693,
    "68.9": 694,
    "69": 695,
    "69.1": 696,
    "69.2": 697,
    "69.3": 698,
    "69.4": 699,
    "69.5": 700,
    "69.6": 701,
    "69.7": 702,
    "69.8": 703,
    "69.9": 704,
    "70": 705,
    "70.1": 706,
    "70.2": 707,
    "70.3": 708,
    "70.4": 709,
    "70.5": 710,
    "70.6": 711,
    "70.7": 712,
    "70.8": 713,
    "70.9": 714,
    "71": 715,
    "71.1": 716,
    "71.2": 717,
    "71.3": 718,
    "71.4": 719,
    "71.5": 720,
    "71.6": 721,
    "71.7": 722,
    "71.8": 723,
    "71.9": 724,
    "72": 725,
    "72.1": 726,
    "72.2": 727,
    "72.3": 728,
    "72.4": 729,
    "72.5": 730,
    "72.6": 731,
    "72.7": 732,
    "72.8": 733,
    "72.9": 734,
    "73": 735,
    "73.1": 736,
    "73.2": 737,
    "73.3": 738,
    "73.4": 739,
    "73.5": 740,
    "73.6": 741,
    "73.7": 742,
    "73.8": 743,
    "73.9": 744,
    "74": 745,
    "74.1": 746,
    "74.2": 747,
    "74.3": 748,
    "74.4": 749,
    "74.5": 750,
    "74.6": 751,
    "74.7": 752,
    "74.8": 753,
    "74.9": 754,
    "75": 755,
    "75.1": 756,
    "75.2": 757,
    "75.3": 758,
    "75.4": 759,
    "75.5": 760,
    "75.6": 761,
    "75.7": 762,
    "75.8": 763,
    "75.9": 764,
    "76": 765,
    "76.1": 766,
    "76.2": 767,
    "76.3": 768,
    "76.4": 769,
    "76.5": 770,
    "76.6": 771,
    "76.7": 772,
    "76.8": 773,
    "76.9": 774,
    "77": 775,
    "77.1": 776,
    "77.2": 777,
    "77.3": 778,
    "77.4": 779,
    "77.5": 780,
    "77.6": 781,
    "77.7": 782,
    "77.8": 783,
    "77.9": 784,
    "78": 785,
    "78.1": 786,
    "78.2": 787,
    "78.3": 788,
    "78.4": 789,
    "78.5": 790,
    "78.6": 791,
    "78.7": 792,
    "78.8": 793,
    "78.9": 794,
    "79": 795,
    "79.1": 796,
    "79.2": 797,
    "79.3": 798,
    "79.4": 799,
    "79.5": 800,
    "79.6": 801,
    "79.7": 802,
    "79.8": 803,
    "79.9": 804,
    "80": 805,
    "80.1": 806,
    "80.2": 807,
    "80.3": 808,
    "80.4": 809,
    "80.5": 810,
    "80.6": 811,
    "80.7": 812,
    "80.8": 813,
    "80.9": 814,
    "81": 815,
    "81.1": 816,
    "81.2": 817,
    "81.3": 818,
    "81.4": 819,
    "81.5": 820,
    "81.6": 821,
    "81.7": 822,
    "81.8": 823,
    "81.9": 824,
    "82": 825,
    "82.1": 826,
    "82.2": 827,
    "82.3": 828,
    "82.4": 829,
    "82.5": 830,
    "82.6": 831,
    "82.7": 832,
    "82.8": 833,
    "82.9": 834,
    "83": 835,
    "83.1": 836,
    "83.2": 837,
    "83.3": 838,
    "83.4": 839,
    "83.5": 840,
    "83.6": 841,
    "83.7": 842,
    "83.8": 843,
    "83.9": 844,
    "84": 845,
    "84.1": 846,
    "84.2": 847,
    "84.3": 848,
    "84.4": 849,
    "84.5": 850,
    "84.6": 851,
    "84.7": 852,
    "84.8": 853,
    "84.9": 854,
    "85": 855,
    "85.1": 856,
    "85.2": 857,
    "85.3": 858,
    "85.4": 859,
    "85.5": 860,
    "85.6": 861,
    "85.7": 862,
    "85.8": 863,
    "85.9": 864,
    "86": 865,
    "86.1": 866,
    "86.2": 867,
    "86.3": 868,
    "86.4": 869,
    "86.5": 870,
    "86.6": 871,
    "86.7": 872,
    "86.8": 873,
    "86.9": 874,
    "87": 875,
    "87.1": 876,
    "87.2": 877,
    "87.3": 878,
    "87.4": 879,
    "87.5": 880,
    "87.6": 881,
    "87.7": 882,
    "87.8": 883,
    "87.9": 884,
    "88": 885,
    "88.1": 886,
    "88.2": 887,
    "88.3": 888,
    "88.4": 889,
    "88.5": 890,
    "88.6": 891,
    "88.7": 892,
    "88.8": 893,
    "88.9": 894,
    "89": 895,
    "89.1": 896,
    "89.2": 897,
    "89.3": 898,
    "89.4": 899,
    "89.5": 900,
    "89.6": 901,
    "89.7": 902,
    "89.8": 903,
    "89.9": 904,
    "90": 905,
    "90.1": 906,
    "90.2": 907,
    "90.3": 908,
    "90.4": 909,
    "90.5": 910,
    "90.6": 911,
    "90.7": 912,
    "90.8": 913,
    "90.9": 914,
    "91": 915,
    "91.1": 916,
    "91.2": 917,
    "91.3": 918,
    "91.4": 919,
    "91.5": 920,
    "91.6": 921,
    "91.7": 922,
    "91.8": 923,
    "91.9": 924,
    "92": 925,
    "92.1": 926,
    "92.2": 927,
    "92.3": 928,
    "92.4": 929,
    "92.5": 930,
    "92.6": 931,
    "92.7": 932,
    "92.8": 933,
    "92.9": 934,
    "93": 935,
    "93.1": 936,
    "93.2": 937,
    "93.3": 938,
    "93.4": 939,
    "93.5": 940,
    "93.6": 941,
    "93.7": 942,
    "93.8": 943,
    "93.9": 944,
    "94": 945,
    "94.1": 946,
    "94.2": 947,
    "94.3": 948,
    "94.4": 949,
    "94.5": 950,
    "94.6": 951,
    "94.7": 952,
    "94.8": 953,
    "94.9": 954,
    "95": 955,
    "95.1": 956,
    "95.2": 957,
    "95.3": 958,
    "95.4": 959,
    "95.5": 960,
    "95.6": 961,
    "95.7": 962,
    "95.8": 963,
    "95.9": 964,
    "96": 965,
    "96.1": 966,
    "96.2": 967,
    "96.3": 968,
    "96.4": 969,
    "96.5": 970,
    "96.6": 971,
    "96.7": 972,
    "96.8": 973,
    "96.9": 974,
    "97": 975,
    "97.1": 976,
    "97.2": 977,
    "97.3": 978,
    "97.4": 979,
    "97.5": 980,
    "97.6": 981,
    "97.7": 982,
    "97.8": 983,
    "97.9": 984,
    "98": 985,
    "98.1": 986,
    "98.2": 987,
    "98.3": 988,
    "98.4": 989,
    "98.5": 990,
    "98.6": 991,
    "98.7": 992,
    "98.8": 993,
    "98.9": 994,
    "99": 995,
    "99.1": 996,
    "99.2": 997,
    "99.3": 998,
    "99.4": 999,
    "99.5": 1000,
    "99.6": 1001,
    "99.7": 1002,
    "99.8": 1003,
    "99.9": 1004,
    "100": 1005,
    "C": 1006,
    "P": 1007,
    "SP": 1008,
    "R": 1009,
    "N": 1010,
    "W": 1011,
    "LY": 1012,
    "L": 1013,
    "S": 1014,
    "M": 1015,
    "TS": 1016,
    "CA": 1017
}